In [3]:
import numpy as np
import pandas as pd

In [4]:
df=pd.read_csv("raw_data.csv")
df

,math score,reading score,writing score,Placement Score,placement offer count
0,72.000000,72.00,74.0,78.000,1
1,69.000000,90.00,88.0,62.125,2
2,90.000000,95.00,93.0,74.000,2
3,47.000000,57.00,77.0,78.000,1
4,52.285714,78.00,75.0,81.000,3
5,71.000000,72.25,78.0,70.000,4
6,12.000000,44.00,52.0,12.000,2
7,52.285714,65.00,67.0,49.000,1
8,5.000000,77.00,89.0,55.000,0

In [3]:
df.describe()

,math score,reading score,writing score,Placement Score,placement offer count
count,9.000000,9.000000,9.0000,9.000000,9.000000
mean,52.285714,72.250000,77.0000,62.125000,1.777778
std,28.123452,15.698328,12.5499,21.791268,1.201850
min,5.000000,44.000000,52.0000,12.000000,0.000000
25%,47.000000,65.000000,74.0000,55.000000,1.000000
50%,52.285714,72.250000,77.0000,70.000000,2.000000
75%,71.000000,78.000000,88.0000,78.000000,2.000000
max,90.000000,95.000000,93.0000,81.000000,4.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   math score             9 non-null      float64
 1   reading score          9 non-null      float64
 2   writing score          9 non-null      float64
 3   Placement Score        9 non-null      float64
 4   placement offer count  9 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 488.0 bytes

In [5]:
df.head()

,math score,reading score,writing score,Placement Score,placement offer count
0,72.000000,72.0,74.0,78.000,1
1,69.000000,90.0,88.0,62.125,2
2,90.000000,95.0,93.0,74.000,2
3,47.000000,57.0,77.0,78.000,1
4,52.285714,78.0,75.0,81.000,3

In [6]:
df.tail()

,math score,reading score,writing score,Placement Score,placement offer count
4,52.285714,78.00,75.0,81.0,3
5,71.000000,72.25,78.0,70.0,4
6,12.000000,44.00,52.0,12.0,2
7,52.285714,65.00,67.0,49.0,1
8,5.000000,77.00,89.0,55.0,0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   math score             9 non-null      float64
 1   reading score          9 non-null      float64
 2   writing score          9 non-null      float64
 3   Placement Score        9 non-null      float64
 4   placement offer count  9 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 488.0 bytes

In [8]:
df.dtypes

math score               float64
reading score            float64
writing score            float64
Placement Score          float64
placement offer count      int64
dtype: object

In [9]:
df.mean()

math score               52.285714
reading score            72.250000
writing score            77.000000
Placement Score          62.125000
placement offer count     1.777778
dtype: float64

In [10]:
df.mode()

,math score,reading score,writing score,Placement Score,placement offer count
0,52.285714,44.00,52.0,78.0,1.0
1,NaN,57.00,67.0,NaN,2.0
2,NaN,65.00,74.0,NaN,NaN
3,NaN,72.00,75.0,NaN,NaN
4,NaN,72.25,77.0,NaN,NaN
5,NaN,77.00,78.0,NaN,NaN
6,NaN,78.00,88.0,NaN,NaN
7,NaN,90.00,89.0,NaN,NaN
8,NaN,95.00,93.0,NaN,NaN

In [11]:
df.std()

math score               28.123452
reading score            15.698328
writing score            12.549900
Placement Score          21.791268
placement offer count     1.201850
dtype: float64

In [12]:
df.min()

math score                5.0
reading score            44.0
writing score            52.0
Placement Score          12.0
placement offer count     0.0
dtype: float64

In [13]:
df.max()

math score               90.0
reading score            95.0
writing score            93.0
Placement Score          81.0
placement offer count     4.0
dtype: float64

In [14]:
df.median()

math score               52.285714
reading score            72.250000
writing score            77.000000
Placement Score          70.000000
placement offer count     2.000000
dtype: float64

In [15]:
df['math score'].mode()

0    52.285714
Name: math score, dtype: float64

In [16]:
df.groupby(['math score']).count()

,reading score,writing score,Placement Score,placement offer count
math score,,,,
5.000000,1,1,1,1
12.000000,1,1,1,1
47.000000,1,1,1,1
52.285714,2,2,2,2
69.000000,1,1,1,1
71.000000,1,1,1,1
72.000000,1,1,1,1
90.000000,1,1,1,1

In [18]:
df['writing score'].std()

12.549900398011133

In [21]:
np.sort(df['math score'])

array([ 5.      , 12.      , 47.      , 52.285714, 52.285714, 69.      ,
       71.      , 72.      , 90.      ])

In [13]:

df['writing score'].mean()

77.0

In [6]:
df.mean().max()

77.0

In [7]:
df.mean().min()

1.7777777777777777

In [8]:
df.mode().max()

math score               52.285714
reading score            95.000000
writing score            93.000000
Placement Score          78.000000
placement offer count     2.000000
dtype: float64

In [9]:
df.median().max()

77.0

In [10]:
df.max().max()

95.0